In [1]:
import pandas as pd
import bz2

In [2]:
pwd

'/Users/cortinas/Documents/DSchallenge/dschallenge'

In [3]:
ls -lrt

total 15510304
-rw-r--r--@ 1 cortinas  staff         679 11 jun 18:33 README.md
-rw-r--r--  1 cortinas  staff  4244874509 11 jun 18:54 bookings.csv
-rw-r--r--  1 cortinas  staff  3696229366 11 jun 18:57 searches.csv
-rw-r--r--  1 cortinas  staff       22135 11 jun 19:11 exercise1.ipynb
-rw-r--r--  1 cortinas  staff       22135 11 jun 19:11 exercise1-Copy1.ipynb
-rw-r--r--  1 cortinas  staff       91707 15 jun 12:23 exercise2.ipynb
-rw-r--r--  1 cortinas  staff       18873 15 jun 13:12 exercise3.ipynb

Exploring "seaches" DATA

In [4]:
searches = pd.read_csv ('searches.csv', sep = '^', nrows = 1000)

In [5]:

searches.columns.tolist()

['Date',
 'Time',
 'TxnCode',
 'OfficeID',
 'Country',
 'Origin',
 'Destination',
 'RoundTrip',
 'NbSegments',
 'Seg1Departure',
 'Seg1Arrival',
 'Seg1Date',
 'Seg1Carrier',
 'Seg1BookingCode',
 'Seg2Departure',
 'Seg2Arrival',
 'Seg2Date',
 'Seg2Carrier',
 'Seg2BookingCode',
 'Seg3Departure',
 'Seg3Arrival',
 'Seg3Date',
 'Seg3Carrier',
 'Seg3BookingCode',
 'Seg4Departure',
 'Seg4Arrival',
 'Seg4Date',
 'Seg4Carrier',
 'Seg4BookingCode',
 'Seg5Departure',
 'Seg5Arrival',
 'Seg5Date',
 'Seg5Carrier',
 'Seg5BookingCode',
 'Seg6Departure',
 'Seg6Arrival',
 'Seg6Date',
 'Seg6Carrier',
 'Seg6BookingCode',
 'From',
 'IsPublishedForNeg',
 'IsFromInternet',
 'IsFromVista',
 'TerminalID',
 'InternetOffice']

In [6]:
searches.isnull().sum()

Date                   0
Time                   0
TxnCode                0
OfficeID               0
Country                0
Origin                 0
Destination            0
RoundTrip              0
NbSegments             0
Seg1Departure          0
Seg1Arrival            0
Seg1Date               4
Seg1Carrier          626
Seg1BookingCode      920
Seg2Departure        288
Seg2Arrival          288
Seg2Date             292
Seg2Carrier          741
Seg2BookingCode      934
Seg3Departure        964
Seg3Arrival          964
Seg3Date             964
Seg3Carrier          964
Seg3BookingCode      965
Seg4Departure        970
Seg4Arrival          970
Seg4Date             970
Seg4Carrier          970
Seg4BookingCode      971
Seg5Departure        995
Seg5Arrival          995
Seg5Date             995
Seg5Carrier          995
Seg5BookingCode      995
Seg6Departure        997
Seg6Arrival          997
Seg6Date             997
Seg6Carrier          997
Seg6BookingCode      997
From                  11
IsPublishedForNeg      0
IsFromInternet         0
IsFromVista            0
TerminalID             0
InternetOffice         0
dtype: int64

In [7]:
searches.head()

,Date,Time,TxnCode,OfficeID,Country,Origin,Destination,RoundTrip,NbSegments,Seg1Departure,...,Seg6Arrival,Seg6Date,Seg6Carrier,Seg6BookingCode,From,IsPublishedForNeg,IsFromInternet,IsFromVista,TerminalID,InternetOffice
0,2013-01-01,20:25:57,MPT,624d8c3ac0b3a7ca03e3c167e0f48327,DE,TXL,AUH,1,2,TXL,...,NaN,NaN,NaN,NaN,1ASIWS,0,0,0,d41d8cd98f00b204e9800998ecf8427e,FRA
1,2013-01-01,10:15:33,MPT,b0af35b31588dc4ab06d5cf2986e8e02,MD,ATH,MIL,0,1,ATH,...,NaN,NaN,NaN,NaN,1ASIWS,0,0,0,d41d8cd98f00b204e9800998ecf8427e,KIV
2,2013-01-01,18:04:49,MPT,3561a60621de06ab1badc8ca55699ef3,US,ICT,SFO,1,2,ICT,...,NaN,NaN,NaN,NaN,1ASIWS,0,0,0,d41d8cd98f00b204e9800998ecf8427e,NYC
3,2013-01-01,17:42:40,FXP,1864e5e8013d9414150e91d26b6a558b,SE,RNB,ARN,0,1,RNB,...,NaN,NaN,NaN,NaN,1ASI,0,0,0,d41d8cd98f00b204e9800998ecf8427e,STO
4,2013-01-01,17:48:29,MPT,1ec336348f44207d2e0027dc3a68c118,NO,OSL,MAD,1,2,OSL,...,NaN,NaN,NaN,NaN,1ASIWS,0,0,0,d41d8cd98f00b204e9800998ecf8427e,OSL

In [8]:

searches = pd.read_csv ('searches.csv', sep = '^', usecols = ['Destination', 'Date'], nrows = 1000)

In [9]:
searches.head()

         Date Destination
0  2013-01-01         AUH
1  2013-01-01         MIL
2  2013-01-01         SFO
3  2013-01-01         ARN
4  2013-01-01         MAD

In [10]:

searches = searches.dropna()

#STEPS

1) To know city codes
2) Get data filtering by MAD , AGP and BCN
3) Grouping by month
4) Grouping by airport and month
5) Sum
6) Plot

In [11]:
from neobase import NeoBase

In [5]:
geo_a = NeoBase()

In [10]:
madrid_code = geo_a.find_with('Madrid','name')
print (madrid_code)

<generator object NeoBase.find_with at 0x7fce45c4f5f0>

CONSULTA DE CODIGOS EN GOOGLE Y PRUEBA EN "searches"

In [13]:
searches = searches.loc[searches['Destination'].isin (['MAD', 'BCN', 'AGP'])]
searches.head()

           Date Destination
4    2013-01-01         MAD
93   2013-01-01         AGP
113  2013-01-01         BCN
147  2013-01-01         AGP
151  2013-01-01         MAD

AGRUPAR POR MESES

In [14]:
searches = pd.read_csv ('searches.csv', sep = '^', usecols = ['Destination', 'Date'], nrows = 1000)
searches=searches.dropna()
searches= searches[searches['Destination'].isin (['MAD', 'BCN', 'AGP'])]

In [15]:
searches.head()

           Date Destination
4    2013-01-01         MAD
93   2013-01-01         AGP
113  2013-01-01         BCN
147  2013-01-01         AGP
151  2013-01-01         MAD

In [16]:
searches['Year-Month']=searches['Date'].str[0:7]

In [17]:
searches.head()

           Date Destination Year-Month
4    2013-01-01         MAD    2013-01
93   2013-01-01         AGP    2013-01
113  2013-01-01         BCN    2013-01
147  2013-01-01         AGP    2013-01
151  2013-01-01         MAD    2013-01

In [18]:
searches.drop('Date', axis = 1, inplace = True)
searches.head()

    Destination Year-Month
4           MAD    2013-01
93          AGP    2013-01
113         BCN    2013-01
147         AGP    2013-01
151         MAD    2013-01